brew "stow"
brew "gh"
brew "mas"
brew "bat"
brew "eza"
brew "fzf"
brew "starship"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "alfred"
cask "clash-verge-rev"
cask "claude"
cask "ghostty"
cask "google-chrome"
cask "neteasemusic"
cask "stats"
cask "visual-studio-code"
cask "db-browser-for-sqlite"

mas "Magnet", id: 441258766
mas "Thor", id: 1120999687