# Common
brew "stow"
brew "btop"
brew "gh"
brew "ghq"
brew "bat"
brew "eza"
brew "fzf"
brew "starship"
brew "tmux"
brew "zoxide"
brew "yazi"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "rustup"
brew "solana"
brew "node"

# neovim stuffs
brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "fd"

# macOS
if OS.mac?
  brew "mas"
  cask "alfred"
  cask "clash-verge-rev"
  cask "claude"
  cask "ghostty"
  cask "google-chrome"
  cask "neteasemusic"
  cask "stats"
  cask "visual-studio-code"
  cask "db-browser-for-sqlite"
  cask "orbstack"
  mas "Magnet", id: 441258766
  mas "Thor", id: 1120999687
end

# Linux
if OS.linux?
  # Add Linux-specific packages here
  brew "inetutils"
end
